crime/app/Models/ModelLokasi.php

SELECT *
FROM `kj_sleman`
---
    public function getSlemanData()
    {
        return $this->db->table('kj_sleman')
            ->get()->getResultArray();

SELECT *
FROM `kj_jogja`
---
    public function getJogjaData()
    {
        return $this->db->table('kj_jogja')
            ->get()->getResultArray();

SELECT *
FROM `kj_bantul`
---
    public function getBantulData()
    {
        return $this->db->table('kj_bantul')
            ->get()->getResultArray();

SELECT *
FROM `kj_kulon_progo`
---
    public function getKulprogData()
    {
        return $this->db->table('kj_kulon_progo')
            ->get()->getResultArray();

SELECT *
FROM `kj_gunung_kidul`
---
    public function getGunkidData()
    {
        return $this->db->table('kj_gunung_kidul')
            ->get()->getResultArray();